using System;
using System.Linq;

namespace NaverLib
{
	internal class NameHelper
	{
		public static string GetRandomId()
		{
			Random random = new Random();
			const string chars = "abcdefghijklmnopqrstuvwxyz0123456789";
			return new string(Enumerable.Repeat(chars, 10)
			  .Select(s => s[random.Next(s.Length)]).ToArray());
		}

		public static string GetRandomPw()
		{
			return RandomString(10) + "@@";
		}

		public static string GetRandomKorName()
		{
			string[] list_first_name = new string[] { "김", "이", "박", "최", "정", "강", "조", "윤", "장", "임", "한", "오", "서", "신", "권", "황", "안", "송", "전", "홍", "유", "고", "문", "양", "손", "배", "백", "허", "남", "심", "노", "정", "남궁", "류", "복", "봉", "사공", "설", "성", "예", "제갈", "추", "탁", "표", "풍", "하", "황보" };
			string[] list_common = new string[] { "동근", "남기", "기남", "다미", "경민", "광민", "동민", "규빈", "다빈", "동빈", "경석", "광석", "동석", "경선", "광선", "남선", "대선", "대성", "경수", "광수", "동수", "경숙", "경식", "광식", "대식", "경아", "기연", "다연", "도연", "동연", "규영", "기영", "다영", "대영", "도영", "동영", "경옥", "기용", "기우", "동우", "동욱", "기웅", "대웅", "경윤", "기윤", "도윤", "동윤", "경원", "규원", "기원", "대원", "도원", "동원", "경일", "광일", "규일", "남일", "대일", "동일", "경은", "다은", "경자", "경재", "기정", "다정", "경주", "동주", "경준", "광준", "기준", "남준", "대준", "도준", "동준", "남지", "경진", "광진", "도진", "동진", "경철", "규철", "기철", "대철", "동철", "경태", "규태", "기태", "대한", "경하", "규하", "기하", "도하", "동하", "광혁", "규혁", "기혁", "남혁", "대혁", "도혁", "동혁", "경현", "광현", "규현", "기현", "다현", "대현", "도현", "동현", "경혜", "다혜", "경호", "광호", "기호", "남호", "동호", "경화", "경환", "광환", "규환", "기환", "도환", "동환", "경훈", "광훈", "기훈", "대훈", "도훈", "동훈", "경희", "광희", "규희", "남희", "다희", "대희", "도희", "미경", "민경", "보경", "병곤", "민국", "민규", "범규", "만기", "민기", "만석", "민석", "범석", "명선", "미선", "민선", "보선", "민성", "만수", "명수", "문수", "민수", "범수", "병수", "명숙", "문숙", "미숙", "민숙", "만식", "문식", "만세", "미나", "민아", "보아", "미연", "보연", "문영", "미영", "민영", "보영", "만옥", "명옥", "문옥", "미옥", "민옥", "병옥", "문용", "민용", "명우", "민우", "범우", "병우", "명욱", "민욱", "병욱", "민웅", "병윤", "명원", "병일", "민은", "명자", "미자", "민자", "민재", "병재", "문정", "미정", "민정", "미주", "민주", "명준", "민준", "범준", "병준", "민지", "병지", "명진", "미진", "문철", "민철", "범철", "병철", "민태", "민하", "병하", "문혁", "민혁", "병현", "문혜", "민혜", "만호", "문호", "민호", "범호", "병호", "명환", "민환", "명훈", "민훈", "병훈", "만희", "명희", "문희", "미희", "민희", "병희", "성경", "수경", "시경", "성근", "수근", "승근", "성기", "승기", "성남", "승남", "상미", "선미", "성미", "세미", "소미", "수미", "승미", "상민", "선민", "성민", "소민", "수민", "승민", "선빈", "성빈", "세빈", "소빈", "수빈", "승빈", "상수", "성수", "승수", "선숙", "성숙", "상식", "승식", "상아", "선아", "설아", "성아", "수아", "시아", "승아", "시안", "서언", "시언", "승언", "서연", "석연", "세연", "소연", "수연", "시연", "승연", "서영", "선영", "세영", "소영", "수영", "시영", "신영", "선옥", "성옥", "선옥", "승옥", "성용", "시용", "승용", "상우", "서우", "선우", "성우", "시우", "신우", "승우", "상욱", "선욱", "성욱", "세욱", "시욱", "승욱", "선웅", "세웅", "시웅", "상윤", "서윤", "성윤", "세윤", "시윤", "승윤", "상원", "서원", "성원", "세원", "소원", "수원", "시원", "승원", "성일", "신일", "승일", "상은", "서은", "성은", "세은", "소은", "시은", "승은", "선자", "성자", "순자", "선재", "성재", "순재", "승재", "서정", "세정", "소정", "수정", "시정", "석주", "선주", "성주", "승주", "상준", "서준", "석준", "선준", "성준", "세준", "시준", "승준", "수지", "신지", "상진", "서진", "석진", "선진", "성진", "세진", "수진", "승진", "상철", "성철", "승철", "성태", "승태", "서하", "성하", "시하", "승하", "상학", "상혁", "성혁", "세혁", "수혁", "시혁", "승혁", "상현", "서현", "설현", "성현", "소현", "수현", "시현", "승현", "선혜", "성혜", "수혜", "신혜", "승혜", "상호", "석호", "선호", "성호", "세호", "수호", "시호", "승호", "상화", "선화", "석환", "성환", "세환", "시환", "승환", "상훈", "석훈", "성훈", "세훈", "소훈", "시훈", "승훈", "상희", "서희", "석희", "선희", "성희", "세희", "소희", "수희", "순희", "승희", "원경", "유경", "인경", "은경", "영근", "영기", "용기", "원기", "윤기", "은기", "영남", "용남", "은남", "영미", "원미", "유미", "윤미", "은미", "영민", "우민", "유민", "윤민", "영빈", "예빈", "우빈", "원빈", "유빈", "윤빈", "은빈", "연석", "영석", "용석", "우석", "원석", "유석", "윤석", "인석", "은석", "영선", "우선", "유선", "윤선", "은선", "예성", "용성", "우성", "유성", "윤성", "인성", "은성", "연수", "영수", "용수", "윤수", "인수", "은수", "연숙", "영숙", "예숙", "원숙", "윤숙", "인숙", "은숙", "영식", "용식", "우식", "원식", "윤식", "인식", "은식", "윤아", "영아", "윤아", "은아", "영연", "우연", "유연", "예영", "우영", "원영", "유영", "윤영", "인영", "은영", "영옥", "원옥", "윤옥", "인옥", "은옥", "원용", "인용", "은용", "연우", "영우", "용우", "원우", "윤우", "인우", "은우", "영욱", "용욱", "인욱", "은욱", "연웅", "원웅", "인웅", "영윤", "영원", "예원", "우원", "유원", "영일", "용일", "우일", "원일", "윤일", "은일", "영은", "예은", "연자", "영자", "용자", "원자", "윤자", "은자", "연재", "영재", "용재", "우재", "원재", "유재", "윤재", "은재", "연정", "우정", "원정", "유정", "윤정", "인정", "은정", "연주", "영주", "우주", "원주", "유주", "윤주", "은주", "연준", "영준", "예준", "용준", "우준", "원준", "유준", "윤준", "인준", "연지", "영지", "예지", "윤지", "은지", "연진", "영진", "예진", "용진", "우진", "원진", "유진", "윤진", "은진", "영철", "용철", "우철", "원철", "윤철", "인철", "은철", "영태", "용태", "우태", "원태", "윤태", "인태", "영하", "용하", "윤하", "인하", "은하", "우혁", "윤혁", "인혁", "은혁", "영현", "용현", "우현", "유현", "영혜", "윤혜", "인혜", "은혜", "영호", "용호", "원호", "윤호", "인호", "영화", "영환", "용환", "영훈", "예훈", "연희", "영희", "용희", "우희", "원희", "윤희", "은희", "재경", "진경", "재근", "준기", "진기", "창기", "재남", "정남", "종남", "주미", "진미", "재민", "정민", "준민", "지민", "창민", "철민", "재빈", "지빈", "재석", "종석", "준석", "지석", "진석", "재선", "지선", "진선", "재성", "준성", "지성", "진성", "정수", "종수", "준수", "지수", "진수", "창수", "철수", "춘수", "재숙", "정숙", "지숙", "진숙", "재식", "정식", "종식", "준식", "창식", "재아", "정아", "주아", "지아", "진아", "정연", "종연", "주연", "지연", "재영", "주영", "준영", "지영", "진영", "채영", "정옥", "종옥", "주옥", "진옥", "재용", "준용", "지용", "진용", "재우", "정우", "종우", "준우", "지우", "진우", "창우", "철우", "재욱", "정욱", "준욱", "진욱", "창욱", "재웅", "준웅", "지웅", "진웅", "재윤", "정윤", "주윤", "지윤", "채윤", "재원", "정원", "주원", "지원", "창원", "채원", "정일", "종일", "준일", "재은", "정은", "주은", "지은", "채은", "정자", "춘자", "정재", "준재", "창재", "재정", "철정", "정주", "진주", "재주", "창준", "철준", "재진", "정진", "종진", "창진", "철진", "재철", "정철", "종철", "준철", "진철", "정태", "준태", "지태", "진태", "재하", "종하", "주하", "준하", "지하", "진하", "창하", "재혁", "정혁", "종혁", "주혁", "준혁", "지혁", "진혁", "재현", "정현", "종현", "주현", "준현", "지현", "창현", "주혜", "지혜", "재호", "정호", "종호", "주호", "준호", "지호", "진호", "창호", "철호", "정화", "천화", "재환", "정환", "종환", "주환", "지환", "진환", "창환", "재훈", "정훈", "종훈", "지훈", "창훈", "재희", "정희", "종희", "주희", "준희", "지희", "진희", "창희", "철희", "천희", "호경", "효경", "현경", "혜경", "희경", "태기", "홍기", "효기", "현기", "형기", "해남", "효남", "형남", "현미", "혜미", "태민", "하민", "효민", "현민", "형민", "혜민", "하빈", "한빈", "해빈", "효빈", "현빈", "형빈", "혜빈", "태석", "호석", "홍석", "현석", "형석", "희석", "하선", "효선", "현선", "혜선", "희선", "태성", "해성", "호성", "효성", "현성", "혜성", "희성", "태수", "현수", "형수", "혜수", "희수", "현숙", "혜숙", "태식", "홍식", "현식", "형식", "현아", "희아", "태연", "효연", "혜연", "태영", "하영", "해영", "호영", "현영", "혜영", "희영", "현옥", "희옥", "태용", "희용", "태우", "현우", "형우", "희우", "태욱", "현욱", "형욱", "희욱", "태웅", "현웅", "희웅", "태윤", "하윤", "해윤", "혜윤", "희윤", "태원", "해원", "효원", "형원", "혜원", "희원", "태일", "해일", "홍일", "형일", "태은", "하은", "효은", "혜은", "희은", "홍자", "현자", "혜자", "희자", "홍재", "호재", "현재", "희재", "호정", "효정", "현정", "혜정", "희주", "태주", "해주", "홍주", "효주", "현주", "형주", "혜주", "희주", "태준", "하준", "해준", "호준", "홍준", "효준", "현준", "형준", "혜준", "희준", "태지", "현지", "혜지", "태진", "하진", "혜진", "호진", "효진", "현진", "형진", "혜진", "희진", "현철", "형철", "희철", "현태", "형태", "희태", "태하", "태현", "하현", "태호", "현호", "형호", "희호", "태화", "태환", "태훈", "하훈", "혜훈", "희훈", "태희", "현희" };

			return list_first_name[new Random().Next(0, list_first_name.Length)] + list_common[new Random().Next(0, list_common.Length)];
		}

		public static string GetRandomYear()
		{
			return new Random().Next(1970, 2000).ToString();
		}

		public static string GetRandomMonth()
		{
			//string ret = "0" +
			//return ret.Substring(ret.Length - 2);
			return new Random().Next(1, 13).ToString("D2");
		}

		public static string GetRandomDate()
		{
			return new Random().Next(1, 29).ToString("D2");
		}

		public static string GetRandomYYYYMMDD()
		{
			return GetRandomYear() + GetRandomMonth() + GetRandomDate();
		}

		private static string RandomString(int length)
		{
			Random random = new Random();
			const string chars = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789";
			return new string(Enumerable.Repeat(chars, length)
			  .Select(s => s[random.Next(s.Length)]).ToArray());
		}

		public static string GetRandomGender()
		{
			return new Random().NextDouble() < 0.5f ? "M" : "F";
		}
	}
}